{"format": "graph-model", "generatedBy": "2.18.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"keras_tensor_91": {"name": "keras_tensor_91:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "17"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "17"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_13_1/normalization_13_1/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "17"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13_1/dense_49_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "17"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13_1/dense_49_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13_1/dense_50_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13_1/dense_50_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13_1/dense_51_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "56"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13_1/dense_51_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "56"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13_1/dense_52_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "56"}, {"size": "28"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13_1/dense_52_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "28"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13_1/dense_53_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "28"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13_1/dense_53_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "keras_tensor_91", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "17"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13_1/normalization_13_1/Sub", "op": "Sub", "input": ["keras_tensor_91", "unknown"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13_1/normalization_13_1/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_13_1/normalization_13_1/Sub", "ConstantFolding/StatefulPartitionedCall/sequential_13_1/normalization_13_1/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13_1/dense_49_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_13_1/normalization_13_1/truediv", "StatefulPartitionedCall/sequential_13_1/dense_49_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_13_1/dense_49_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13_1/dense_50_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_13_1/dense_49_1/Relu", "StatefulPartitionedCall/sequential_13_1/dense_50_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_13_1/dense_50_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13_1/dense_51_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_13_1/dense_50_1/Relu", "StatefulPartitionedCall/sequential_13_1/dense_51_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_13_1/dense_51_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13_1/dense_52_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_13_1/dense_51_1/Relu", "StatefulPartitionedCall/sequential_13_1/dense_52_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_13_1/dense_52_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13_1/dense_53_1/Add", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_13_1/dense_52_1/Relu", "StatefulPartitionedCall/sequential_13_1/dense_53_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_13_1/dense_53_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13_1/dense_53_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_13_1/dense_53_1/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_13_1/dense_53_1/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1994}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "unknown", "shape": [1, 17], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_13_1/normalization_13_1/truediv_recip", "shape": [1, 17], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_13_1/dense_49_1/Cast/ReadVariableOp", "shape": [17, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_13_1/dense_49_1/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_13_1/dense_50_1/Cast/ReadVariableOp", "shape": [256, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_13_1/dense_50_1/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_13_1/dense_51_1/Cast/ReadVariableOp", "shape": [128, 56], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_13_1/dense_51_1/BiasAdd/ReadVariableOp", "shape": [56], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_13_1/dense_52_1/Cast/ReadVariableOp", "shape": [56, 28], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_13_1/dense_52_1/BiasAdd/ReadVariableOp", "shape": [28], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_13_1/dense_53_1/Cast/ReadVariableOp", "shape": [28, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_13_1/dense_53_1/Add/ReadVariableOp", "shape": [1], "dtype": "float32"}]}]}